Revit 2027 API
SpatialFieldManager.AllowInteractiveSettings Property
 If true interactive settings dialog and pick deletion are allowed.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowInteractiveSettings { get; set; }
Public Property AllowInteractiveSettings As Boolean
	Get
	Set
public:
property bool AllowInteractiveSettings {
	bool get ();
	void set (bool value);
}
member AllowInteractiveSettings : bool with get, set
Property Value
Boolean
Remarks
 Note that SpatialFieldManager cannot be deleted if this property is set to false.
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace